content-org/all_posts.org
#+hugo_base_dir: ../

* Activities
:PROPERTIES:
:EXPORT_FILE_NAME: activities
:EXPORT_HUGO_SECTION: en
:EXPORT_HUGO_SECTION:
:EXPORT_HUGO_FRONT_MATTER_FORMAT: yaml
:EXPORT_OPTIONS: author:nil
:END:
#+begin_src yaml :front_matter_extra t
draft: false
share: false
commentable: false
editable: false

# Optional header image (relative to `static/media/` folder).
header:
  caption: ''
  image: ''

#+end_src

** Mentorship

I'm open to mentor early career (MSc/PhD) students to guide them in their own research topics. Please [[mailto:koustuv.sinha@mail.mcgill.ca?subject=Mentorship Request][contact me]] with your CV and brief description of the research problem (no need to write an elaborate plan) you are interested in, and I'll get back to you. You can check out my [[https://www.cs.mcgill.ca/~ksinha4/publications/][publications]] page to understand my area of expertise, to evaluate where I can guide you the best.

** Supervising

- Kexin (Nicole) Liang, 2021-present
- [[https://shanyas10.github.io/][Shanya Sharma]], 2020-2022
- Manan Dey, 2020-2022

** Tutorials

- /Towards Reproducible Machine Learning Research in Natural Language Processing/, ACL 2022 ([[https://acl-reproducibility-tutorial.github.io/][Website]], [[https://aclanthology.org/2022.acl-tutorials.2/][ACL Anthology]])
- /Towards Reproducible Machine Learning Research in Information Retrieval/, SIGIR 2022 ([[https://sigir.org/sigir2022/program/tutorials/][Conference Website]])

** Public Talks

- Panelist, /Reproducibility and Rigor in ML/,
  [[https://ml-eval.github.io/panels/][ML Evaluation Standards Workshop]] at ICLR 2022, April 2022
- /Evaluating Logical Generalization with Graph Neural Networks/,
  Weights and Biases Salon,
  ([[https://www.youtube.com/watch?v=HllTbhy3WSA][Online]]) May 2020
- /ML Reproducibility - From Theory to Practice/
  - [[https://dl4sci-school.lbl.gov/][DL4Science Seminar]], Lawrence Berkeley National Laboratory, Berkeley, ([[https://www.youtube.com/watch?v=se7LNICECqI][Online]]) August 2020
  - [[https://miccai-hackathon.com/][MICCAI Hackathon]], Peru, 2020 (Online), October 2020
  - Bielefield University, Germany, hosted by [[https://ni.www.techfak.uni-bielefeld.de/people/mschilli][Malte Schilling]], October 2021 (Online)

** Conference Organization

- [[https://iclr.cc/Conferences/2023/Committees][ICLR 2023]], Journal Chair
- [[https://neurips.cc/Conferences/2022/Committees][NeurIPS 2022]], Journal Chair
- [[https://neurips.cc/Conferences/2020/Committees][NeurIPS 2020]], Reproducibility Co-Chair
- [[https://neurips.cc/Conferences/2019/Committees][NeurIPS 2019]], Reproducibility Co-Chair

** Workshop Organization

- [Upcoming] [[https://genbench.org/workshop/][Genbench: the first workshop on (benchmarking) generalisation in NLP @ EMNLP 2023]]
- [[https://www.cs.mcgill.ca/~pparth2/nilli_workshop/][NILLI: Novel Ideas for Learning to Learn with Interaction @ EMNLP 2022]]
- [[https://www.cs.mcgill.ca/~pparth2/nilli_workshop/][NILLI: Novel Ideas for Learning to Learn with Interaction @ EMNLP 2021]]
- [[https://ml-retrospectives.github.io/neurips2019/][ML Retrospectives@ NeurIPS 2019]]

** Reproducibility Challenge Organization

- [[https://paperswithcode.com/rc2022][2022 ML Reproducibility Challenge]]
- [[https://paperswithcode.com/rc2021][2021 ML Reproducibility Challenge]]
- [[https://paperswithcode.com/rc2020][2020 ML Reproducibility Challenge]]
- [[https://reproducibility-challenge.github.io/neurips2019/][2019 NeurIPS Reproducibility Challenge]]
- [[https://github.com/reproducibility-challenge/iclr_2019/][ICLR 2019 Reproducibility Challenge]]
- [[https://www.cs.mcgill.ca/~jpineau/ICLR2018-ReproducibilityChallenge.html][ICLR 2018 Reproducibility Challenge]]

** Conference Volunteering

- NeurIPS 2018, Montreal, Canada
- MAIS 2018, Montreal, Canada
- ICWSM 2017, Montreal, Canada

** Teaching Assistantship

- Winter 2022: [[https://www.mcgill.ca/study/2021-2022/courses/comp-424][COMP 424 Artificial Intelligence]]
- Fall 2018: [[https://rllabmcgill.github.io/COMP-652/index.html][COMP 652 Machine Learning]]
- Winter 2018: [[http://www.sarathchandar.in/teaching/2018/winter/comp551-001/][COMP 551 Applied Machine Learning]]
- Fall 2017: [[http://cs.mcgill.ca/~jpineau/comp551/][COMP 551 Applied Machine Learning]]
- Winter 2017: COMP 102B Computers and Computing
- Fall 2016: [[http://www.derekruths.com/teaching/comp-189/][COMP 189 Computers and Society]]

