content/en/activities.md
---
title: "Activities"
draft: false
draft: false
share: false
commentable: false
editable: false

# Optional header image (relative to `static/media/` folder).
header:
  caption: ''
  image: ''
---

## Mentorship {#mentorship}

I'm open to mentor early career (MSc/PhD) students to guide them in their own research topics. Please [contact me](mailto:koustuv.sinha@mail.mcgill.ca?subject=Mentorship%20Request) with your CV and brief description of the research problem (no need to write an elaborate plan) you are interested in, and I'll get back to you. You can check out my [publications](https://www.cs.mcgill.ca/~ksinha4/publications/) page to understand my area of expertise, to evaluate where I can guide you the best.


## Supervising {#supervising}

-   [Bhargavi Paranjape](https://bhargaviparanjape.github.io/), Research Intern @ Meta AI, 2023-present
-   Kexin (Nicole) Liang, 2021-2022
-   [Shanya Sharma](https://shanyas10.github.io/), 2020-2022
-   Manan Dey, 2020-2022


## Tutorials {#tutorials}

-   _Towards Reproducible Machine Learning Research in Natural Language Processing_, ACL 2022 ([Website](https://acl-reproducibility-tutorial.github.io/), [ACL Anthology](https://aclanthology.org/2022.acl-tutorials.2/))
-   _Towards Reproducible Machine Learning Research in Information Retrieval_, SIGIR 2022 ([Conference Website](https://sigir.org/sigir2022/program/tutorials/))


## Public Talks {#public-talks}

-   Panelist, _Reproducibility and Rigor in ML_,
    [ML Evaluation Standards Workshop](https://ml-eval.github.io/panels/) at ICLR 2022, April 2022
-   _Evaluating Logical Generalization with Graph Neural Networks_,
    Weights and Biases Salon,
    ([Online](https://www.youtube.com/watch?v=HllTbhy3WSA)) May 2020
-   _ML Reproducibility - From Theory to Practice_
    -   [DL4Science Seminar](https://dl4sci-school.lbl.gov/), Lawrence Berkeley National Laboratory, Berkeley, ([Online](https://www.youtube.com/watch?v=se7LNICECqI)) August 2020
    -   [MICCAI Hackathon](https://miccai-hackathon.com/), Peru, 2020 (Online), October 2020
    -   Bielefield University, Germany, hosted by [Malte Schilling](https://ni.www.techfak.uni-bielefeld.de/people/mschilli), October 2021 (Online)


## Conference Organization {#conference-organization}

-   [ICLR 2023](https://iclr.cc/Conferences/2023/Committees), Journal Chair
-   [NeurIPS 2022](https://neurips.cc/Conferences/2022/Committees), Journal Chair
-   [NeurIPS 2020](https://neurips.cc/Conferences/2020/Committees), Reproducibility Co-Chair
-   [NeurIPS 2019](https://neurips.cc/Conferences/2019/Committees), Reproducibility Co-Chair


## Workshop Organization {#workshop-organization}

-   [Upcoming] [Genbench: the first workshop on (benchmarking) generalisation in NLP @ EMNLP 2023](https://genbench.org/workshop/)
-   [NILLI: Novel Ideas for Learning to Learn with Interaction @ EMNLP 2022](https://www.cs.mcgill.ca/~pparth2/nilli_workshop/)
-   [NILLI: Novel Ideas for Learning to Learn with Interaction @ EMNLP 2021](https://www.cs.mcgill.ca/~pparth2/nilli_workshop/)
-   [ML Retrospectives@ NeurIPS 2019](https://ml-retrospectives.github.io/neurips2019/)


## Reproducibility Challenge Organization {#reproducibility-challenge-organization}

-   [2022 ML Reproducibility Challenge](https://paperswithcode.com/rc2022)
-   [2021 ML Reproducibility Challenge](https://paperswithcode.com/rc2021)
-   [2020 ML Reproducibility Challenge](https://paperswithcode.com/rc2020)
-   [2019 NeurIPS Reproducibility Challenge](https://reproducibility-challenge.github.io/neurips2019/)
-   [ICLR 2019 Reproducibility Challenge](https://github.com/reproducibility-challenge/iclr_2019/)
-   [ICLR 2018 Reproducibility Challenge](https://www.cs.mcgill.ca/~jpineau/ICLR2018-ReproducibilityChallenge.html)


## Conference Volunteering {#conference-volunteering}

-   NeurIPS 2018, Montreal, Canada
-   MAIS 2018, Montreal, Canada
-   ICWSM 2017, Montreal, Canada


## Teaching Assistantship {#teaching-assistantship}

-   Winter 2022: [COMP 424 Artificial Intelligence](https://www.mcgill.ca/study/2021-2022/courses/comp-424)
-   Fall 2018: [COMP 652 Machine Learning](https://rllabmcgill.github.io/COMP-652/index.html)
-   Winter 2018: [COMP 551 Applied Machine Learning](http://www.sarathchandar.in/teaching/2018/winter/comp551-001/)
-   Fall 2017: [COMP 551 Applied Machine Learning](http://cs.mcgill.ca/~jpineau/comp551/)
-   Winter 2017: COMP 102B Computers and Computing
-   Fall 2016: [COMP 189 Computers and Society](http://www.derekruths.com/teaching/comp-189/)
